#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resources.data.google_iam_policy.noauth: Reading...
module.resources.google_service_account.service_account: Refreshing state... [id=projects/angular-box-415904/serviceAccounts/notification-api@angular-box-415904.iam.gserviceaccount.com]
module.resources.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.resources.google_cloud_run_service.service: Refreshing state... [id=locations/us-east1/namespaces/angular-box-415904/services/notification-api]
module.resources.google_project_iam_member.member["roles/iam.serviceAccountUser"]: Refreshing state... [id=angular-box-415904/roles/iam.serviceAccountUser/serviceAccount:notification-api@angular-box-415904.iam.gserviceaccount.com]
module.resources.google_project_iam_member.member["roles/cloudbuild.serviceAgent"]: Refreshing state... [id=angular-box-415904/roles/cloudbuild.serviceAgent/serviceAccount:notification-api@angular-box-415904.iam.gserviceaccount.com]
module.resources.google_project_iam_member.member["roles/secretmanager.secretAccessor"]: Refreshing state... [id=angular-box-415904/roles/secretmanager.secretAccessor/serviceAccount:notification-api@angular-box-415904.iam.gserviceaccount.com]
module.resources.google_project_iam_member.member["roles/pubsub.admin"]: Refreshing state... [id=angular-box-415904/roles/pubsub.admin/serviceAccount:notification-api@angular-box-415904.iam.gserviceaccount.com]
module.resources.google_project_iam_member.member["roles/run.admin"]: Refreshing state... [id=angular-box-415904/roles/run.admin/serviceAccount:notification-api@angular-box-415904.iam.gserviceaccount.com]
module.resources.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/angular-box-415904/locations/us-east1/services/notification-api]
module.resources.google_cloudbuild_trigger.trigger: Refreshing state... [id=projects/angular-box-415904/triggers/d54dc281-e1d9-4874-8f02-b0744a6f9116]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resources.google_cloudbuild_trigger.trigger will be created
  + resource "google_cloudbuild_trigger" "trigger" {
      + create_time     = (known after apply)
      + description     = "Deploy notification-api"
      + id              = (known after apply)
      + location        = "global"
      + name            = "notification-api-trigger"
      + project         = "angular-box-415904"
      + service_account = "projects/angular-box-415904/serviceAccounts/notification-api@angular-box-415904.iam.gserviceaccount.com"
      + substitutions   = {
          + "_ENVIRONMENT"   = "main"
          + "_MAX_INSTANCES" = "2"
          + "_MIN_INSTANCES" = "0"
          + "_REGION"        = "us-east1"
          + "_SERVICE_NAME"  = "notification-api"
          + "_SERVICE_URI"   = "https://notification-api-wx4tnh2atq-ue.a.run.app"
          + "_SUFFIX"        = ""
        }
      + trigger_id      = (known after apply)

      + git_file_source {
          + path      = "infra/cloudbuild.yaml"
          + repo_type = "GITHUB"
          + revision  = "refs/heads/main"
          + uri       = "https://github.com/felipesilvaibi/notification-api"
        }

      + source_to_build {
          + ref       = "refs/heads/main"
          + repo_type = "GITHUB"
          + uri       = "https://github.com/felipesilvaibi/notification-api"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @felipesilvaibi, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*